Revit 2027 API
Transform2D(Transform2D) Constructor
 The copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform2D(
	Transform2D other
)
Public Sub New (
	other As Transform2D
)
public:
Transform2D(
	Transform2D^ other
)
new :
        other : Transform2D -> Transform2D
Parameters
other Transform2D
 The transformation to use as input.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Transform2D Class
Transform2D Overload
Autodesk.Revit.DB Namespace